In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
connection_str = "mysql+pymysql://root:aodlvmf12@localhost/movies"

In [2]:
engine = create_engine(connection_str)

In [3]:
database_exists(connection_str)

True

In [4]:
if database_exists(connection_str)==False:
    create_database(connection_str)
else:
    print('The database already exists')

The database already exists

In [5]:
# I have the issue with the project 3 part 2 now... so i cant go forward to finish this assignment

df_2000=pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
df_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')

In [6]:
df1 = df_2000

df2 = df_2001

frames = [df1, df2]

merged = pd.concat(frames)

In [8]:
merged.head(3)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certificiation
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN

In [9]:
merged = merged[['imdb_id','revenue','budget','certificiation']]
merged.head()

     imdb_id     revenue      budget certificiation
0          0         NaN         NaN            NaN
1  tt0113026         0.0  10000000.0            NaN
2  tt0113092         0.0         0.0            NaN
3  tt0116391         0.0         0.0            NaN
4  tt0118694  12854953.0    150000.0             PG

In [10]:
merged.to_csv('Data/merged_data.csv.gz',compression='gzip',index=False)

In [11]:
merged.to_sql('tmdb_data', engine, if_exists='replace')

2500

In [12]:
q="""SELECT 
    *
FROM
    tmdb_data
LIMIT 5;"""
pd.read_sql(q,engine)

   index    imdb_id     revenue      budget certificiation
0      0          0         NaN         NaN           None
1      1  tt0113026         0.0  10000000.0           None
2      2  tt0113092         0.0         0.0           None
3      3  tt0116391         0.0         0.0           None
4      4  tt0118694  12854953.0    150000.0             PG

In [13]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [14]:

basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83268 entries, 0 to 83267
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          83268 non-null  object
 1   titleType       83268 non-null  object
 2   primaryTitle    83268 non-null  object
 3   originalTitle   83268 non-null  object
 4   isAdult         83268 non-null  int64
 5   startYear       83268 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  83268 non-null  int64
 8   genres          83268 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.7+ MB

In [15]:

basics.isna().sum()

tconst                0
titleType             0
primaryTitle          0
originalTitle         0
isAdult               0
startYear             0
endYear           83268
runtimeMinutes        0
genres                0
dtype: int64

In [16]:
basics['genres_split']=basics['genres'].str.split(',')
basics['genres_split']

0           [Comedy, Fantasy, Romance]
1                              [Drama]
2                              [Drama]
3             [Comedy, Horror, Sci-Fi]
4                              [Drama]
                     ...
83263                          [Drama]
83264         [Comedy, Drama, Fantasy]
83265                          [Drama]
83266    [Action, Adventure, Thriller]
83267                 [Drama, History]
Name: genres_split, Length: 83268, dtype: object

In [17]:

exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
83266,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
83266,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
83266,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
83267,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
83267,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [18]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [19]:
title_genres=exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [20]:
#Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_id_map = dict(zip(unique_genres, genre_ints))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [21]:
# make a new interger genre_id and drop string genres
title_genres['genre_id']=title_genres['genres_split'].map(genre_id_map)
title_genres=title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [22]:

genres = pd.DataFrame({'Genre_Name':genre_id_map.keys(),
                     'Genre_ID':genre_id_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [23]:
title_basics=pd.read_csv('Data/title_basics.csv.gz')
title_basics.to_sql('title_basics',engine,if_exists='replace')

83268

In [24]:
q="""SELECT 
    *
FROM
    title_basics
LIMIT 5;"""
pd.read_sql(q,engine)

,index,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,None,118,"Comedy,Fantasy,Romance"
1,1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,None,70,Drama
2,2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,None,122,Drama
3,3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,None,100,"Comedy,Horror,Sci-Fi"
4,4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,None,126,Drama

In [25]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.to_sql('title_ratings',engine,if_exists='replace')

473283

In [26]:

q="""SELECT 
    *
FROM
    title_ratings
LIMIT 5;"""
pd.read_sql(q,engine)

   index     tconst  averageRating  numVotes
0      0  tt0000001            5.7      1921
1      1  tt0000002            5.8       260
2      2  tt0000005            6.2      2544
3      3  tt0000006            5.1       175
4      4  tt0000007            5.4       797

In [27]:
genres.to_sql('genres',engine,if_exists='replace')

26

In [28]:

q="""SELECT 
    *
FROM
    genres
LIMIT 5;"""
pd.read_sql(q,engine)

   index Genre_Name  Genre_ID
0      0     Action         0
1      1      Adult         1
2      2  Adventure         2
3      3  Animation         3
4      4  Biography         4

In [29]:
title_genres.to_sql('title_genres',engine,if_exists='replace')

155601

In [30]:
q="""SELECT 
    *
FROM
    title_genres
LIMIT 5;"""
pd.read_sql(q,engine)

   index     tconst  genre_id
0      0  tt0035423         5
1      0  tt0035423         9
2      0  tt0035423        18
3      1  tt0062336         7
4      2  tt0069049         7

In [31]:
max_str_len=title_basics['tconst'].fillna('').map(len).max()

In [32]:

## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [33]:
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

83268

In [34]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [35]:

max_str_len=merged['imdb_id'].fillna('').map(len).max()

In [36]:

## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = merged['imdb_id'].fillna('').map(len).max()
title_len = merged['imdb_id'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'revenue':Float(),
    'budget':Float(),
    'certificiation':Text(max_str_len+1)}

In [37]:
merged.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2500

In [38]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [39]:

title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

155601

In [40]:

## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "Genre_ID": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [41]:

genres.to_sql('titles_genres',engine,dtype=df_schema,if_exists='replace',index=False)

26

In [42]:

engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [43]:
q="""SHOW TABLES FROM movies"""
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4    titles_genres
5        tmdb_data